module Daikichi
  class Config
    Biz = ::Biz.configure do |config|
      config.hours = {
        mon: {'09:30' => '12:30', '13:30' => '18:30'},
        tue: {'09:30' => '12:30', '13:30' => '18:30'},
        wed: {'09:30' => '12:30', '13:30' => '18:30'},
        thu: {'09:30' => '12:30', '13:30' => '18:30'},
        fri: {'09:30' => '12:30', '13:30' => '18:30'},
        sat: {'09:30' => '12:30', '13:30' => '18:30'}
      }

      config.holidays = [
        Date.new(2017,  1,  1),
        Date.new(2017,  1,  2), # 元旦逢週日，週一補放假
        Date.new(2017,  1, 27), # 除夕放假
        Date.new(2017,  1, 28), # 春節
        Date.new(2017,  1, 29), # 初二回娘家
        Date.new(2017,  1, 30), # 大年初三
        Date.new(2017,  1, 31), # 春節放三天逢週六、週日補假二天
        Date.new(2017,  2,  1), # 春節放三天逢週六、週日補假二天
        Date.new(2017,  2, 27), # 二二八逢週二，週一彈性放假一天
        Date.new(2017,  2, 28), # 和平紀念日
        Date.new(2017,  4,  3), # 兒童節、清明節連假
        Date.new(2017,  4,  4), # 兒童節、清明節連假
        Date.new(2017,  5,  1), # 五一勞動節
        Date.new(2017,  5, 29), # 端午節逢週二，週一彈性放假
        Date.new(2017,  5, 30), # 端午節
        Date.new(2017, 10,  4), # 中秋節放假
        Date.new(2017, 10,  9), # 國慶日逢週二，週一彈性放假一天
        Date.new(2017, 10, 10), # 國慶日放假

        # 週六放假設定
        Date.new(2017,  1,  7), # 週六休假
        Date.new(2017,  1, 14), # 週六休假
        Date.new(2017,  1, 21), # 週六休假
        Date.new(2017,  1, 29), # 週六休假
        Date.new(2017,  2,  4), # 週六休假
        Date.new(2017,  2, 11), # 週六休假
        # Date.new(2017,  2, 18), # 二二八彈性放假補上班
        Date.new(2017,  2, 25), # 週六休假
        Date.new(2017,  3,  4), # 週六休假
        Date.new(2017,  3, 18), # 週六休假
        Date.new(2017,  3, 25), # 週六休假
        Date.new(2017,  4,  1), # 週六休假
        Date.new(2017,  4,  8), # 週六休假
        Date.new(2017,  4, 15), # 週六休假
        Date.new(2017,  4, 22), # 週六休假
        Date.new(2017,  4, 29), # 週六休假
        Date.new(2017,  5,  6), # 週六休假
        Date.new(2017,  5, 13), # 週六休假
        Date.new(2017,  5, 20), # 週六休假
        Date.new(2017,  5, 27), # 週六休假
        # Date.new(2017,  6,  3), # 端午節彈性放假補上班
        Date.new(2017,  6, 10), # 週六休假
        Date.new(2017,  6, 17), # 週六休假
        Date.new(2017,  6, 24), # 週六休假
        Date.new(2017,  7,  1), # 週六休假
        Date.new(2017,  7,  8), # 週六休假
        Date.new(2017,  7, 15), # 週六休假
        Date.new(2017,  7, 22), # 週六休假
        Date.new(2017,  7, 29), # 週六休假
        Date.new(2017,  8,  5), # 週六休假
        Date.new(2017,  8, 12), # 週六休假
        Date.new(2017,  8, 19), # 週六休假
        Date.new(2017,  8, 26), # 週六休假
        Date.new(2017,  9,  2), # 週六休假
        Date.new(2017,  9,  9), # 週六休假
        Date.new(2017,  9, 16), # 週六休假
        Date.new(2017,  9, 23), # 週六休假
        # Date.new(2017,  9, 30), # 國慶日彈性放假補上班
        Date.new(2017, 10,  7), # 週六休假
        Date.new(2017, 10, 14), # 週六休假
        Date.new(2017, 10, 21), # 週六休假
        Date.new(2017, 10, 28), # 週六休假
        Date.new(2017, 11,  4), # 週六休假
        Date.new(2017, 11, 11), # 週六休假
        Date.new(2017, 11, 18), # 週六休假
        Date.new(2017, 11, 25), # 週六休假
        Date.new(2017, 12,  2), # 週六休假
        Date.new(2017, 12,  9), # 週六休假
        Date.new(2017, 12, 16), # 週六休假
        Date.new(2017, 12, 23), # 週六休假
        Date.new(2017, 12, 30), # 週六休假

        # 2018 休假日設定
        Date.new(2018,  1,  1),
        Date.new(2018,  2, 15), # 除夕放假
        Date.new(2018,  2, 16), # 春節
        Date.new(2018,  2, 19), # 春節放三天逢週六、週日補假二天
        Date.new(2018,  2, 20), # 春節放三天逢週六、週日補假二天
        Date.new(2018,  2, 28), # 和平紀念日
        Date.new(2018,  4,  4), # 兒童節、清明節連假
        Date.new(2018,  4,  5), # 兒童節、清明節連假
        Date.new(2018,  4,  6), # 兒童節、清明節連假
        Date.new(2018,  5,  1), # 五一勞動節
        Date.new(2018,  6, 18), # 端午節
        Date.new(2018,  9, 24), # 中秋節放假
        Date.new(2018, 10, 10), # 國慶日放假
        Date.new(2018, 12, 31), # 元旦逢週二，彈性調整放假

        # 週六放假設定
        Date.new(2018,  1,  6), # 週六休假
        Date.new(2018,  1, 13), # 週六休假
        Date.new(2018,  1, 20), # 週六休假
        Date.new(2018,  1, 27), # 週六休假
        Date.new(2018,  2,  3), # 週六休假
        Date.new(2018,  2, 10), # 週六休假
        Date.new(2018,  2, 17), # 週六休假
        Date.new(2018,  2, 24), # 週六休假
        Date.new(2018,  3,  3), # 週六休假
        Date.new(2018,  3, 10), # 週六休假
        Date.new(2018,  3, 17), # 週六休假
        Date.new(2018,  3, 24), # 週六休假
        Date.new(2018,  4,  7), # 週六休假
        Date.new(2018,  4, 14), # 週六休假
        Date.new(2018,  4, 21), # 週六休假
        Date.new(2018,  4, 28), # 週六休假
        Date.new(2018,  5,  5), # 週六休假
        Date.new(2018,  5, 12), # 週六休假
        Date.new(2018,  5, 19), # 週六休假
        Date.new(2018,  5, 26), # 週六休假
        Date.new(2018,  6,  2), # 週六休假
        Date.new(2018,  6,  9), # 週六休假
        Date.new(2018,  6, 16), # 週六休假
        Date.new(2018,  6, 23), # 週六休假
        Date.new(2018,  6, 30), # 週六休假
        Date.new(2018,  7,  7), # 週六休假
        Date.new(2018,  7, 14), # 週六休假
        Date.new(2018,  7, 21), # 週六休假
        Date.new(2018,  7, 28), # 週六休假
        Date.new(2018,  8,  4), # 週六休假
        Date.new(2018,  8, 11), # 週六休假
        Date.new(2018,  8, 18), # 週六休假
        Date.new(2018,  8, 25), # 週六休假
        Date.new(2018,  9,  1), # 週六休假
        Date.new(2018,  9,  8), # 週六休假
        Date.new(2018,  9, 15), # 週六休假
        Date.new(2018,  9, 22), # 週六休假
        Date.new(2018,  9, 29), # 週六休假
        Date.new(2018, 10,  6), # 週六休假
        Date.new(2018, 10, 13), # 週六休假
        Date.new(2018, 10, 20), # 週六休假
        Date.new(2018, 10, 27), # 週六休假
        Date.new(2018, 11,  3), # 週六休假
        Date.new(2018, 11, 10), # 週六休假
        Date.new(2018, 11, 17), # 週六休假
        Date.new(2018, 11, 24), # 週六休假
        Date.new(2018, 12,  1), # 週六休假
        Date.new(2018, 12,  8), # 週六休假
        Date.new(2018, 12, 15), # 週六休假
        Date.new(2018, 12, 29)  # 週六休假
      ]

      config.time_zone = 'Asia/Taipei'
    end
  end
end
